import type { LinkType } from '$types/link';
import MdOndemandVideo from 'svelte-icons/md/MdOndemandVideo.svelte';

const data: LinkType[] = [
  {
    color: '#FF6D28',
    name: '南工在线',
    icon: MdOndemandVideo,
    link: 'https://online.njtech.edu.cn',
    subtitle: '视频在线播放平台',
    tags: ['校内', '视频', '网站'],
    detail:
      '南工在线是一家为南京工业大学师生提供视频服务的在线平台。作为一家专注于高等教育的视频网站，南工在线致力于提供高质量的在线课程、学术讲座、演讲和文化活动。南工在线的目标是为南工大师生提供一个多样化、易于访问、高质量的教育资源库。\n南工在线的视频资源库包括了数百个主题的课程，涵盖了各种学科领域。每个课程都由南工大的教授或其他专家录制，内容全面、深入浅出。南工在线的视频资源库还包括了大量的学术讲座和演讲，涉及到了科技、文化、艺术、历史等方方面面的内容。这些视频资源可以帮助南工大师生们扩展知识面，加强学科理解，提高学术能力。\n南工在线的平台设计简洁、易于使用，访问速度快，能够在任何设备上进行访问。师生们可以通过南工在线网站、APP、微信公众号等多种方式访问平台。在这里，用户可以搜索感兴趣的视频资源，观看高清视频，还可以按照自己的兴趣和需求进行定制化的学习体验。\n南工在线的优势不仅仅在于其视频资源库，更在于其专业的技术团队和完善的服务体系。南工在线的技术团队由一群优秀的技术人员组成，他们不断地完善平台的技术架构，保证南工在线的稳定性和可靠性。同时，南工在线的客服团队也能够为用户提供及时、专业的技术支持和服务，解决用户在使用平台过程中的各种问题。\n总之，南工在线是一家为南工大师生提供高质量教育资源的优秀视频网站。在南工在线，师生们可以轻松地访问各种课程、学术讲座和文化活动，提高自己的学习能力和文化素养。如果你是南工大的师生，那么南工在线就是你提升自己的绝佳选择。'
  },
  {
    color: '#FA2FB5',
    name: '南工在线',
    icon: MdOndemandVideo,
    link: 'https://online.njtech.edu.cn',
    subtitle: '视频在线播放平台',
    tags: ['视频', '网站'],
    detail:
      '南工在线是一家为南京工业大学师生提供视频服务的在线平台。作为一家专注于高等教育的视频网站，南工在线致力于提供高质量的在线课程、学术讲座、演讲和文化活动。南工在线的目标是为南工大师生提供一个多样化、易于访问、高质量的教育资源库。\n南工在线的视频资源库包括了数百个主题的课程，涵盖了各种学科领域。每个课程都由南工大的教授或其他专家录制，内容全面、深入浅出。南工在线的视频资源库还包括了大量的学术讲座和演讲，涉及到了科技、文化、艺术、历史等方方面面的内容。这些视频资源可以帮助南工大师生们扩展知识面，加强学科理解，提高学术能力。\n南工在线的平台设计简洁、易于使用，访问速度快，能够在任何设备上进行访问。师生们可以通过南工在线网站、APP、微信公众号等多种方式访问平台。在这里，用户可以搜索感兴趣的视频资源，观看高清视频，还可以按照自己的兴趣和需求进行定制化的学习体验。\n南工在线的优势不仅仅在于其视频资源库，更在于其专业的技术团队和完善的服务体系。南工在线的技术团队由一群优秀的技术人员组成，他们不断地完善平台的技术架构，保证南工在线的稳定性和可靠性。同时，南工在线的客服团队也能够为用户提供及时、专业的技术支持和服务，解决用户在使用平台过程中的各种问题。\n总之，南工在线是一家为南工大师生提供高质量教育资源的优秀视频网站。在南工在线，师生们可以轻松地访问各种课程、学术讲座和文化活动，提高自己的学习能力和文化素养。如果你是南工大的师生，那么南工在线就是你提升自己的绝佳选择。'
  },
  {
    color: '#8758FF',
    name: '南工在线',
    icon: MdOndemandVideo,
    link: 'https://online.njtech.edu.cn',
    subtitle: '视频在线播放平台',
    tags: ['校内', '视频', '学习'],
    detail:
      '南工在线是一家为南京工业大学师生提供视频服务的在线平台。作为一家专注于高等教育的视频网站，南工在线致力于提供高质量的在线课程、学术讲座、演讲和文化活动。南工在线的目标是为南工大师生提供一个多样化、易于访问、高质量的教育资源库。\n南工在线的视频资源库包括了数百个主题的课程，涵盖了各种学科领域。每个课程都由南工大的教授或其他专家录制，内容全面、深入浅出。南工在线的视频资源库还包括了大量的学术讲座和演讲，涉及到了科技、文化、艺术、历史等方方面面的内容。这些视频资源可以帮助南工大师生们扩展知识面，加强学科理解，提高学术能力。\n南工在线的平台设计简洁、易于使用，访问速度快，能够在任何设备上进行访问。师生们可以通过南工在线网站、APP、微信公众号等多种方式访问平台。在这里，用户可以搜索感兴趣的视频资源，观看高清视频，还可以按照自己的兴趣和需求进行定制化的学习体验。\n南工在线的优势不仅仅在于其视频资源库，更在于其专业的技术团队和完善的服务体系。南工在线的技术团队由一群优秀的技术人员组成，他们不断地完善平台的技术架构，保证南工在线的稳定性和可靠性。同时，南工在线的客服团队也能够为用户提供及时、专业的技术支持和服务，解决用户在使用平台过程中的各种问题。\n总之，南工在线是一家为南工大师生提供高质量教育资源的优秀视频网站。在南工在线，师生们可以轻松地访问各种课程、学术讲座和文化活动，提高自己的学习能力和文化素养。如果你是南工大的师生，那么南工在线就是你提升自己的绝佳选择。'
  },
  {
    color: '#42855B',
    name: '南工在线',
    icon: MdOndemandVideo,
    link: 'https://online.njtech.edu.cn',
    subtitle: '视频在线播放平台',
    tags: ['校内', '视频'],
    detail:
      '南工在线是一家为南京工业大学师生提供视频服务的在线平台。作为一家专注于高等教育的视频网站，南工在线致力于提供高质量的在线课程、学术讲座、演讲和文化活动。南工在线的目标是为南工大师生提供一个多样化、易于访问、高质量的教育资源库。\n南工在线的视频资源库包括了数百个主题的课程，涵盖了各种学科领域。每个课程都由南工大的教授或其他专家录制，内容全面、深入浅出。南工在线的视频资源库还包括了大量的学术讲座和演讲，涉及到了科技、文化、艺术、历史等方方面面的内容。这些视频资源可以帮助南工大师生们扩展知识面，加强学科理解，提高学术能力。\n南工在线的平台设计简洁、易于使用，访问速度快，能够在任何设备上进行访问。师生们可以通过南工在线网站、APP、微信公众号等多种方式访问平台。在这里，用户可以搜索感兴趣的视频资源，观看高清视频，还可以按照自己的兴趣和需求进行定制化的学习体验。\n南工在线的优势不仅仅在于其视频资源库，更在于其专业的技术团队和完善的服务体系。南工在线的技术团队由一群优秀的技术人员组成，他们不断地完善平台的技术架构，保证南工在线的稳定性和可靠性。同时，南工在线的客服团队也能够为用户提供及时、专业的技术支持和服务，解决用户在使用平台过程中的各种问题。\n总之，南工在线是一家为南工大师生提供高质量教育资源的优秀视频网站。在南工在线，师生们可以轻松地访问各种课程、学术讲座和文化活动，提高自己的学习能力和文化素养。如果你是南工大的师生，那么南工在线就是你提升自己的绝佳选择。'
  }
];

export default data;
